blog/2021/emacs-error-about-ispell-hunspell-dict-paths-alist.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 10:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs 未指定 <code>ispell-hunspell-dict-paths-alist</code> 报错</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Emacs 未指定 <code>ispell-hunspell-dict-paths-alist</code> 报错</h1>
</header><p>
今天在使用过程中，出现错误：
</p>

<pre class="example" id="orgf0af62a">
Error running timer ‘auto-save-buffers’: (error "Can’t find Hunspell dictionary with a .aff affi\
x file")
</pre>

<p>
我的 Arch Linux 已安装 Hunspell，我又安装了 hunspell-en_us。
</p>

<p>
安装后错误变为：
</p>

<pre class="example" id="orgeb35966">
Error running timer ‘auto-save-buffers’: (error "ispell-phaf: No matching entry for hunspelldict\
 in ‘ispell-hunspell-dict-paths-alist’.
")
</pre>

<p>
在这里<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>学会配置 Hunspell 环境，然后进行了修改<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，问题解决。
</p>

<p>
对 <code>~/.emacs.d/lisp/init-spelling.el</code> 进行的修改：
</p>

<pre class="example" id="org4b25c9c">
+    (setq ispell-hunspell-dict-paths-alist
+          '(("en_US" "/usr/share/hunspell/en_US.aff")))
+    (setq ispell-local-dictionary "en_US")
     (setq ispell-local-dictionary-alist
-          (list (list "hunspelldict" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil (list "-d" my-default-spell-check-language) nil 'utf-8)))
+          (list (list "en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil (list "-d" my-default-spell-check-language) nil 'utf-8)))
</pre>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/redguardtoo/emacs.d/blob/8ad48855ff/lisp/init-spelling.el#L61-L83">https://github.com/redguardtoo/emacs.d/blob/8ad48855ff/lisp/init-spelling.el#L61-L83</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/tianheg/emacs.d/commit/32fa8b8">https://github.com/tianheg/emacs.d/commit/32fa8b8</a>
</p></div></div>


</div>
</div></div>
</body>
</html>